TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_vector_fpu64_f2838x.c
#include "fpu.h"
#include "dsp_examples_setup.h"
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

#define TEST_SIZE_VEC   (64U)

float64_t test_input[130] = {
     1.125541798361L, -2.052159867208L, -0.656497261735L, -0.685257998008L,
    -0.832920102136L,  2.082120331303L,  3.066081352433L,  1.906094688038L,
    -2.904472363724L, -2.761641029122L,  2.420081969933L, -0.632982095493L,
     2.596757723074L,  0.168865823368L,  1.860978162734L, -0.522764360647L,
    -2.521365114703L,  0.985579762252L, -1.496207478720L,  0.804080330174L,
    -1.034483484073L, -1.307002572444L,  1.129264023384L, -0.429448362856L,
    -2.283603987309L, -3.044284173343L,  1.390013368633L,  3.041462080758L,
    -2.470788093372L, -2.091242556589L,  0.966085914025L, -2.474215675752L,
    -0.036606235707L, -0.801673246622L,  1.753333687350L, -1.896778017650L,
     1.351117811506L, -0.064794481300L,  2.536651094294L, -1.008492626689L,
     2.456238535457L,  2.837677900566L, -1.041984270427L,  2.641024096838L,
     1.248756893589L, -2.810613315736L, -1.898716856941L,  1.494506490946L,
    -2.949698228501L, -1.450665427766L,  1.533563806602L, -0.484838130014L,
     0.000140966971L,  0.300781743155L, -0.126152907751L,  2.781798514554L,
     2.542944819714L, -0.516829035186L,  0.690312511118L,  3.035108159920L,
     0.739319730211L, -1.247495349066L,  2.258442613615L,  1.263540748369L,
     1.919446663704L,  1.045137828288L,  0.482055499655L,  0.245838830279L,
    -1.992256881409L,  1.244733693668L, -1.634055370062L,  1.046325738726L,
     2.428526098953L, -2.022353433370L, -2.961427640131L, -2.337254458161L,
    -0.063451447323L,  3.135814603466L, -2.086475279162L, -2.066407283710L,
     3.007639224657L, -2.936755657030L,  1.336398779371L,  0.384529638356L,
     0.002963301960L,  2.399337984943L, -0.181657100285L,  1.062959787788L,
    -2.766996260783L, -1.945065147247L,  1.143363194469L, -0.823621631786L,
    -2.874989953878L, -0.246766213959L, -2.692687560146L,  3.026220496919L,
     0.136029972074L, -2.158871355790L, -2.533819976840L,  2.233815670058L,
     1.998986319111L,  0.909582411063L,  1.995207223290L, -0.777404630466L,
     1.397629178494L, -1.941983696889L, -2.199960307358L, -0.450799740346L,
     1.002829380022L, -0.112958721978L,  0.116835469570L, -2.383767537046L,
     2.971786773162L,  0.562392112719L,  0.936141157905L, -1.720413547503L,
     1.887032658351L, -0.724959422492L, -0.290297557685L,  0.521418820776L,
    -0.424796710068L, -1.559448124614L,  2.044006859493L, -1.316700139197L,
    -2.617136339275L,  0.735703724424L, -2.304854535250L, -1.474783538796L,
     8.212372427893L, -3.141592653590L, };
const float64_t test_golden[128] = {
     9.337914226254L, -5.193752520798L,  7.555875166158L, -3.826850651598L,
     7.379452325757L, -1.059472322286L, 11.278453780326L, -1.235497965552L,
     5.307900064169L, -5.903233682711L, 10.632454397827L, -3.774574749083L,
    10.809130150967L, -2.972726830222L, 10.073350590627L, -3.664357014237L,
     5.691007313190L, -2.156012891338L,  6.716164949174L, -2.337512323416L,
     7.177888943820L, -4.448595226034L,  9.341636451277L, -3.571041016446L,
     5.928768440584L, -6.185876826933L,  9.602385796526L, -0.100130572832L,
     5.741584334521L, -5.232835210179L,  9.178458341918L, -5.615808329341L,
     8.175766192186L, -3.943265900212L,  9.965706115243L, -5.038370671240L,
     9.563490239399L, -3.206387134890L, 10.749023522187L, -4.150085280279L,
    10.668610963350L, -0.303914753024L,  7.170388157466L, -0.500568556752L,
     9.461129321482L, -5.952205969325L,  6.313655570952L, -1.647086162644L,
     5.262674199392L, -4.592258081356L,  9.745936234495L, -3.626430783604L,
     8.212513394864L, -2.840810910435L,  8.086219520142L, -0.359794139036L,
    10.755317247607L, -3.658421688776L,  8.902684939011L, -0.106484493670L,
     8.951692158104L, -4.389088002655L, 10.470815041508L, -1.878051905221L,
    10.131819091597L, -2.096454825301L,  8.694427927548L, -2.895753823311L,
     6.220115546484L, -1.896858959922L,  6.578317057831L, -2.095266914863L,
    10.640898526846L, -5.163946086960L,  5.250944787762L, -5.478847111750L,
     8.148920980570L, -0.005778050124L,  6.125897148731L, -5.207999937300L,
    11.220011652550L, -6.078348310620L,  9.548771207264L, -2.757063015234L,
     8.215335729853L, -0.742254668647L,  8.030715327608L, -2.078632865802L,
     5.445376167110L, -5.086657800836L,  9.355735622362L, -3.965214285375L,
     5.337382474015L, -3.388358867548L,  5.519684867747L, -0.115372156670L,
     8.348402399967L, -5.300464009380L,  5.678552451053L, -0.907776983532L,
    10.211358747004L, -2.232010242527L, 10.207579651183L, -3.918997284056L,
     9.610001606388L, -5.083576350478L,  6.012412120535L, -3.592392393936L,
     9.215201807915L, -3.254551375568L,  8.329207897463L, -5.525360190636L,
    11.184159201055L, -2.579200540871L,  9.148513585798L, -4.862006201093L,
    10.099405086244L, -3.866552076081L,  7.922074870208L, -2.620173832814L,
     7.787575717825L, -4.701040778204L, 10.256379287386L, -4.458292792787L,
     5.595236088618L, -2.405888929166L,  5.907517892643L, -4.616376192386L,
};

float64_t test_input_sub[130] = {
    -2.028793199495L, -1.294505486107L,  1.022953222804L,  1.547632909909L,
    -1.062932771739L, -3.076645765089L,  2.503762246355L, -2.837189043422L,
    -2.399201646743L,  1.055048107910L,  3.068820353905L,  0.650108515769L,
     0.251214937225L,  0.164006629568L,  1.300100488888L,  1.443307029997L,
     3.138398408457L,  1.302212053796L, -1.332981879566L,  1.767944157643L,
    -0.537070727722L, -1.332179951605L, -0.220917162181L,  1.209714148026L,
     1.658491237307L,  0.356067074406L,  1.999334941950L, -0.650179035650L,
    -2.511882144771L, -2.754607079297L, -2.022450825969L,  1.760394782897L,
    -0.881939849250L, -1.020490679037L, -2.785306584388L,  0.677741483660L,
     0.137511743186L,  1.515843899130L, -1.031391310468L, -2.483031631624L,
    -2.037831587405L, -2.338046264778L, -1.828741981572L,  0.311269672514L,
     2.545654889088L, -0.092806362957L,  1.102015268448L,  2.453431050263L,
    -0.198120143072L,  1.878422831267L,  2.589504706754L,  1.472408453947L,
    -2.488068655159L, -2.819064900979L,  1.542811482518L, -2.683640813182L,
     1.484512205570L, -2.585358219680L,  0.388686798411L,  1.874593765785L,
    -1.984267006411L,  2.783502233512L,  0.610796928134L,  1.154318985256L,
    -1.257032964378L, -2.311690966921L, -2.298873412685L,  1.399419555120L,
    -1.805777822906L, -2.448221285422L,  2.481491732323L, -2.403363291251L,
    -2.692641390130L,  0.884156786036L, -1.618004669290L, -1.075592010638L,
    -2.803843846268L,  0.966429440441L, -0.366171114785L,  1.565339148528L,
    -3.058131843582L,  0.522671365644L,  2.495626860576L,  1.508167596461L,
    -1.905952795052L, -1.666131633115L, -2.554928394590L,  1.476281773796L,
    -1.210349466186L,  2.956857738405L, -0.276097822051L,  2.305491017895L,
    -2.502785013377L, -2.599765122580L,  3.112625458130L, -0.839203489920L,
    -1.054991841821L, -0.821848150795L, -1.273307508866L,  1.162568180837L,
    -2.751751030614L,  0.615385444405L, -1.267670511470L,  1.818127279118L,
    -2.850359067012L, -0.831561238319L,  0.034106024936L, -1.847081433877L,
     1.642587290168L, -2.597050676370L,  0.823537093271L,  1.708611192441L,
    -2.576786754195L, -1.849301522261L, -2.633519064674L, -0.702010046196L,
     1.741953665799L,  0.325334111221L,  2.545536672334L, -1.703036944447L,
     0.212195431137L,  0.891839220584L, -2.455756512268L, -0.097512696121L,
     2.047117428627L, -2.187519081218L, -1.017262034421L,  1.771430790090L,
    -0.661791219504L, -3.141592653590L, };
const float64_t test_golden_sub[128] = {
    -1.367001979991L,  1.847087167483L,  1.684744442308L,  4.689225563499L,
    -0.401141552235L,  0.064946888501L,  3.165553465860L,  0.304403610168L,
    -1.737410427238L,  4.196640761500L,  3.730611573409L,  3.791701169359L,
     0.913006156730L,  3.305599283158L,  1.961891708393L,  4.584899683586L,
     3.800189627962L,  4.443804707385L, -0.671190660062L,  4.909536811233L,
     0.124720491783L,  1.809412701985L,  0.440874057324L,  4.351306801616L,
     2.320282456811L,  3.497659727996L,  2.661126161454L,  2.491413617940L,
    -1.850090925266L,  0.386985574293L, -1.360659606464L,  4.901987436486L,
    -0.220148629746L,  2.121101974553L, -2.123515364883L,  3.819334137250L,
     0.799302962691L,  4.657436552720L, -0.369600090964L,  0.658561021966L,
    -1.376040367901L,  0.803546388812L, -1.166950762068L,  3.452862326104L,
     3.207446108593L,  3.048786290632L,  1.763806487953L,  5.595023703852L,
     0.463671076432L,  5.020015484857L,  3.251295926258L,  4.614001107537L,
    -1.826277435655L,  0.322527752611L,  2.204602702023L,  0.457951840408L,
     2.146303425074L,  0.556234433910L,  1.050478017915L,  5.016186419375L,
    -1.322475786907L,  5.925094887101L,  1.272588147638L,  4.295911638846L,
    -0.595241744873L,  0.829901686668L, -1.637082193180L,  4.541012208710L,
    -1.143986603401L,  0.693371368168L,  3.143282951827L,  0.738229362339L,
    -2.030850170625L,  4.025749439626L, -0.956213449786L,  2.066000642952L,
    -2.142052626763L,  4.108022094031L,  0.295620104719L,  4.706931802118L,
    -2.396340624077L,  3.664264019234L,  3.157418080080L,  4.649760250051L,
    -1.244161575548L,  1.475461020474L, -1.893137175086L,  4.617874427385L,
    -0.548558246681L,  6.098450391994L,  0.385693397454L,  5.447083671485L,
    -1.840993793872L,  0.541827531010L,  3.774416677635L,  2.302389163669L,
    -0.393200622317L,  2.319744502795L, -0.611516289362L,  4.304160834427L,
    -2.089959811109L,  3.756978097995L, -0.605879291965L,  4.959719932708L,
    -2.188567847508L,  2.310031415271L,  0.695897244440L,  1.294511219713L,
     2.304378509672L,  0.544541977220L,  1.485328312775L,  4.850203846031L,
    -1.914995534691L,  1.292291131329L, -1.971727845170L,  2.439582607394L,
     2.403744885303L,  3.466926764811L,  3.207327891838L,  1.438555709143L,
     0.873986650642L,  4.033431874174L, -1.793965292763L,  3.044079957469L,
     2.708908648132L,  0.954073572371L, -0.355470814917L,  4.913023443680L,
};

float64_t *test_scalar = &test_input[2U*TEST_SIZE_VEC];
float64_t test_output[2U*TEST_SIZE_VEC];
float64_t *test_scalar_sub = &test_input_sub[2U*TEST_SIZE_VEC];
float64_t test_output_sub[2U*TEST_SIZE_VEC];
uint16_t pass = 0U, fail = 0U, pass_sub = 0U, fail_sub = 0U;
float64_t tolerance = 1.0e-6;

void main(void)
{
    //
    // CPU initialization
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    //
    // Variable initialization
    //
    uint16_t i, i_v;
    float64u_t out, gold, err, out_sub, gold_sub, err_sub;

    //
    // Run vector subtraction function
    //
    sub_DP_CSxCV((complexf64_t *)test_output_sub, (const complexf64_t *)test_input_sub, (const complexf64_t *)test_scalar_sub, TEST_SIZE_VEC);

    //
    // Verify results
    //
    for(i_v = 0U; i_v < 2U*TEST_SIZE_VEC; i_v++)
    {
        out_sub.f64  = test_output_sub[i_v];
        gold_sub.f64 = test_golden_sub[i_v];
        err_sub.f64 = fabsf(out_sub.f64 - gold_sub.f64);
        if(err_sub.f64 < tolerance)
        {
            pass_sub++;
        }
        else
        {
            fail_sub++;
        }
    }

    //
    // Run vector addition function
    //
    add_DP_CSxCV((complexf64_t *)test_output, (const complexf64_t *)test_input, (const complexf64_t *)test_scalar, TEST_SIZE_VEC);

    //
    // Verify results
    //
    for(i = 0U; i < 2U*TEST_SIZE_VEC; i++)
    {
        out.f64  = test_output[i];
        gold.f64 = test_golden[i];

        err.f64 = fabsf(out.f64 - gold.f64);
        if(err.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }
    while(1);
}
